dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_uart.c
/*******************************************************************************
* File Name: cy_hal_uart.c
*
* Description:
* Provides a high level interface for interacting with the Cypress UART. This is
* a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include "cy_hal_uart.h"
#include "cy_hal_hwmgr.h"
#include "cy_hal_gpio.h"
#include "cy_hal_interconnect.h"
#include "cy_scb_uart.h"
#include "cy_hal_scb_common.h"

#define UART_OVERSAMPLE                 12

/* Default UART configuration */
static const cy_stc_scb_uart_config_t default_uart_config = {
    .uartMode                   = CY_SCB_UART_STANDARD,
    .enableMutliProcessorMode   = false,
    .smartCardRetryOnNack       = false,
    .irdaInvertRx               = false,
    .irdaEnableLowPowerReceiver = false,

    .oversample                 = UART_OVERSAMPLE,

    .enableMsbFirst             = false,
    .dataWidth                  = 8UL,
    .parity                     = CY_SCB_UART_PARITY_NONE,
    .stopBits                   = CY_SCB_UART_STOP_BITS_1,
    .enableInputFilter          = false,
    .breakWidth                 = 11UL,
    .dropOnFrameError           = false,
    .dropOnParityError          = false,

    .receiverAddress            = 0x0UL,
    .receiverAddressMask        = 0x0UL,
    .acceptAddrInFifo           = false,

    .enableCts                  = false,
    .ctsPolarity                = CY_SCB_UART_ACTIVE_LOW,
    .rtsRxFifoLevel             = 20UL,
    .rtsPolarity                = CY_SCB_UART_ACTIVE_LOW,

    .rxFifoTriggerLevel         = 0UL,  /* Level triggers when at least one element is in FIFO */
    .rxFifoIntEnableMask        = 0x0UL,

    .txFifoTriggerLevel         = 63UL, /* Level triggers when half-fifo is half empty */
    .txFifoIntEnableMask        = 0x0UL
};

static cy_uart_irq_event_t cy_convert_interrupt_cause(uint32_t pdl_cause);

static cy_uart_t *cy_uart_config_structs[CY_IP_MXSCB_INSTANCES];
static cy_uart_irq_handler_t cy_uart_user_callbacks[CY_IP_MXSCB_INSTANCES];
static void *cy_uart_callback_args[CY_IP_MXSCB_INSTANCES];

static void cy_uart_0_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_1_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_2_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_3_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_4_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_5_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_6_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_7_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_8_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_9_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_10_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_11_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_12_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_13_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_14_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_15_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_16_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_17_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_18_cb_wrapper(uint32_t event) __attribute__((unused));
static void cy_uart_19_cb_wrapper(uint32_t event) __attribute__((unused));

static void cy_uart_0_irq_handler(void) __attribute__((unused));
static void cy_uart_1_irq_handler(void) __attribute__((unused));
static void cy_uart_2_irq_handler(void) __attribute__((unused));
static void cy_uart_3_irq_handler(void) __attribute__((unused));
static void cy_uart_4_irq_handler(void) __attribute__((unused));
static void cy_uart_5_irq_handler(void) __attribute__((unused));
static void cy_uart_6_irq_handler(void) __attribute__((unused));
static void cy_uart_7_irq_handler(void) __attribute__((unused));
static void cy_uart_8_irq_handler(void) __attribute__((unused));
static void cy_uart_9_irq_handler(void) __attribute__((unused));
static void cy_uart_10_irq_handler(void) __attribute__((unused));
static void cy_uart_11_irq_handler(void) __attribute__((unused));
static void cy_uart_12_irq_handler(void) __attribute__((unused));
static void cy_uart_13_irq_handler(void) __attribute__((unused));
static void cy_uart_14_irq_handler(void) __attribute__((unused));
static void cy_uart_15_irq_handler(void) __attribute__((unused));
static void cy_uart_16_irq_handler(void) __attribute__((unused));
static void cy_uart_17_irq_handler(void) __attribute__((unused));
static void cy_uart_18_irq_handler(void) __attribute__((unused));
static void cy_uart_19_irq_handler(void) __attribute__((unused));

static __INLINE  void cy_uart_cb_wrapper_indexed(uint32_t event, uint8_t idx)
{
    if (NULL != cy_uart_user_callbacks[idx])
    {
        cy_uart_irq_event_t anded_events = (cy_uart_irq_event_t)(cy_uart_config_structs[idx]->irq_cause & (uint32_t)cy_convert_interrupt_cause(event));
        if (anded_events)
        {
            cy_uart_user_callbacks[idx](cy_uart_callback_args[idx], anded_events);
        }
    }
}
static void cy_uart_0_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 0);
}
static void cy_uart_1_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 1);
}
static void cy_uart_2_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 2);
}
static void cy_uart_3_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 3);
}
static void cy_uart_4_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 4);
}
static void cy_uart_5_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 5);
}
static void cy_uart_6_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 6);
}
static void cy_uart_7_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 7);
}
static void cy_uart_8_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 8);
}
static void cy_uart_9_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 9);
}
static void cy_uart_10_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 10);
}
static void cy_uart_11_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 11);
}
static void cy_uart_12_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 12);
}
static void cy_uart_13_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 13);
}
static void cy_uart_14_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 14);
}
static void cy_uart_15_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 15);
}
static void cy_uart_16_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 16);
}
static void cy_uart_17_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 17);
}
static void cy_uart_18_cb_wrapper(uint32_t event)
{
    cy_uart_cb_wrapper_indexed(event, 18);
}
static void cy_uart_19_cb_wrapper(uint32_t event) 
{
    cy_uart_cb_wrapper_indexed(event, 19);
}

static void (*cy_uart_cb_wrapper_table[CY_IP_MXSCB_INSTANCES])(uint32_t event) =
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cy_uart_0_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cy_uart_1_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cy_uart_2_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cy_uart_3_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cy_uart_4_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cy_uart_5_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cy_uart_6_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cy_uart_7_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cy_uart_8_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cy_uart_9_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cy_uart_10_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cy_uart_11_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cy_uart_12_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cy_uart_13_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cy_uart_14_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cy_uart_15_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cy_uart_16_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cy_uart_17_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cy_uart_18_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cy_uart_19_cb_wrapper,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

static void cy_uart_interrupts_dispatcher_IRQHandler(uint32_t uart_num)
{
    Cy_SCB_UART_Interrupt(cy_uart_config_structs[uart_num]->base, &(cy_uart_config_structs[uart_num]->context));
}
static void cy_uart_0_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(0);
}
static void cy_uart_1_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(1);
}
static void cy_uart_2_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(2);
}
static void cy_uart_3_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(3);
}
static void cy_uart_4_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(4);
}
static void cy_uart_5_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(5);
}
static void cy_uart_6_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(6);
}
static void cy_uart_7_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(7);
}
static void cy_uart_8_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(8);
}
static void cy_uart_9_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(9);
}
static void cy_uart_10_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(10);
}
static void cy_uart_11_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(11);
}
static void cy_uart_12_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(12);
}
static void cy_uart_13_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(13);
}
static void cy_uart_14_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(14);
}
static void cy_uart_15_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(15);
}
static void cy_uart_16_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(16);
}
static void cy_uart_17_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(17);
}
static void cy_uart_18_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(18);
}
static void cy_uart_19_irq_handler(void)
{
    cy_uart_interrupts_dispatcher_IRQHandler(19);
}
static void (*cy_uart_interrupts_dispatcher_table[CY_IP_MXSCB_INSTANCES])(void) = 
{
#if (CY_IP_MXSCB_INSTANCES > 0)
    cy_uart_0_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 1)
    cy_uart_1_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 2)
    cy_uart_2_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 3)
    cy_uart_3_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 4)
    cy_uart_4_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 5)
    cy_uart_5_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 6)
    cy_uart_6_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 7)
    cy_uart_7_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 8)
    cy_uart_8_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 9)
    cy_uart_9_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 10)
    cy_uart_10_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 11)
    cy_uart_11_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 12)
    cy_uart_12_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 13)
    cy_uart_13_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 14)
    cy_uart_14_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 15)
    cy_uart_15_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 16)
    cy_uart_16_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 17)
    cy_uart_17_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 18)
    cy_uart_18_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 19)
    cy_uart_19_irq_handler,
#endif
#if (CY_IP_MXSCB_INSTANCES > 20)
    #error "Unhandled scb count"
#endif
};

static cy_rslt_t free_resources(cy_uart_t *obj)
{
    cy_rslt_t error_accum = CY_RSLT_SUCCESS;
    cy_rslt_t error;
    if (obj->resource.type != CY_RSC_INVALID)
    {
        error = cy_hwmgr_free(&(obj->resource));
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    if (obj->pin_rx != NC)
    {
        error = cy_disconnect_pin(obj->pin_rx);
        if (error == CY_RSLT_SUCCESS)
        {
			cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_rx);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    if (obj->pin_tx != NC)
    {
        error = cy_disconnect_pin(obj->pin_tx);
        if (error == CY_RSLT_SUCCESS)
        {
			cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_tx);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    if (obj->pin_rts != NC)
    {
        error = cy_disconnect_pin(obj->pin_rts);
        if (error == CY_RSLT_SUCCESS)
        {
			cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_rts);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    if (obj->pin_cts != NC)
    {
        error = cy_disconnect_pin(obj->pin_cts);
        if (error == CY_RSLT_SUCCESS)
        {
			cy_resource_inst_t rsc = cy_utils_get_gpio_resource(obj->pin_cts);
            error = cy_hwmgr_free(&rsc);
        }
        if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
        {
            error_accum = error;
        }
    }
    return error_accum;
}

static cy_en_scb_uart_parity_t convert_parity(cy_uart_parity_t parity)
{
    switch (parity)
    {
        case CY_UART_PARITY_NONE:
            return CY_SCB_UART_PARITY_NONE;
        case CY_UART_PARITY_EVEN:
            return CY_SCB_UART_PARITY_EVEN;
        case CY_UART_PARITY_ODD:
            return CY_SCB_UART_PARITY_ODD;
        default:
            return CY_SCB_UART_PARITY_NONE;
    }
}

static cy_en_scb_uart_stop_bits_t convert_stopbits(uint8_t stopbits)
{
    switch (stopbits)
    {
        case 1:
            return CY_SCB_UART_STOP_BITS_1;
        case 2:
            return CY_SCB_UART_STOP_BITS_2;
        case 3:
            return CY_SCB_UART_STOP_BITS_3;
        case 4:
            return CY_SCB_UART_STOP_BITS_4;
        default:
            CY_ASSERT(false);
            return CY_SCB_UART_STOP_BITS_1;
    }
}

cy_rslt_t cy_uart_init(cy_uart_t *obj, cy_gpio_t tx, cy_gpio_t rx, const cy_clock_divider_t *clk, const cy_hal_uart_cfg_t *cfg)
{
    // If something go wrong, any resource not marked as invalid will be freed.
    // Explicitly marked not allocated resources as invalid to prevent freeing them.
    memset(obj, 0, sizeof(cy_uart_t));
	cy_resource_inst_t pin_rsc;
    
    // Reserve the UART
    const cy_resource_pin_mapping_t *tx_map = CY_UTILS_GET_RESOURCE(tx, cy_pin_map_scb_uart_tx);
    const cy_resource_pin_mapping_t *rx_map = CY_UTILS_GET_RESOURCE(rx, cy_pin_map_scb_uart_rx);
    if (NULL == tx_map || NULL == rx_map || tx_map->inst->block_num != rx_map->inst->block_num)
    {
        return CY_RSLT_ERR_CSP_UART_INVALID_PIN;
    }

    obj->resource = *rx_map->inst;
    
    // reserve the TX pin
	pin_rsc = cy_utils_get_gpio_resource(tx);
	cy_rslt_t result = cy_hwmgr_reserve(&pin_rsc);
    if (result == CY_RSLT_SUCCESS)
    {
        obj->pin_tx = tx;
    }
    
    //reseve the RX pin
    if (result == CY_RSLT_SUCCESS)
    {
		pin_rsc = cy_utils_get_gpio_resource(rx);
		cy_rslt_t result = cy_hwmgr_reserve(&pin_rsc);
		if (result == CY_RSLT_SUCCESS)
		{
			obj->pin_rx = rx;
		}
	}
    
    obj->base = CY_SCB_BASE_ADDRESSES[obj->resource.block_num];
    
    if (result == CY_RSLT_SUCCESS)
    {
        if (clk == NULL)
        {
            result = cy_hwmgr_allocate_clock(&(obj->clock), CY_SYSCLK_DIV_8_BIT, true);
        }
        else
        {
            obj->clock = *clk;
        }
    }
	
    if (result == CY_RSLT_SUCCESS)
    {
        cy_en_sysclk_status_t clock_assign_result = Cy_SysClk_PeriphAssignDivider(
                (en_clk_dst_t)((uint8_t)PCLK_SCB0_CLOCK + obj->resource.block_num), obj->clock.div_type, obj->clock.div_num);
        result = clock_assign_result == CY_SYSCLK_SUCCESS
            ? CY_RSLT_SUCCESS
            : CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_MODULE_UART, CY_UART_CLOCK_ERROR);
    }    
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_connect_pin(rx_map);
    }
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_connect_pin(tx_map);
    }

    bool configured = false;
    if (result == CY_RSLT_SUCCESS)
    {
        result = cy_hwmgr_is_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num, &configured);
    }
    
    if (result == CY_RSLT_SUCCESS && !configured)
    {
        if (cfg == NULL)
        {
            Cy_SCB_UART_Init(obj->base, &default_uart_config, &(obj->context));
        }
        else 
        {
            cy_stc_scb_uart_config_t config_structure = default_uart_config;
            config_structure.dataWidth = cfg->data_bits;
            config_structure.stopBits = convert_stopbits(cfg->stop_bits);
            config_structure.parity = convert_parity(cfg->parity);
            Cy_SCB_UART_Init(obj->base, &config_structure, &(obj->context));
            if (cfg->rx_buffer != NULL)
            {
                Cy_SCB_UART_StartRingBuffer(obj->base, cfg->rx_buffer, cfg->rx_buffer_size, &(obj->context));
            }
        }        
        cy_hwmgr_set_configured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    }
    if (result != CY_RSLT_SUCCESS)
    {
        free_resources(obj);
    }
    return result;
}

