dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_uart.c
cy_rslt_t cy_uart_free(cy_uart_t *obj)
{
    cy_rslt_t error_accum = CY_RSLT_SUCCESS;
    cy_rslt_t error = free_resources(obj);
    if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
    {
        error_accum = error;
    }
    error = cy_hwmgr_set_unconfigured(obj->resource.type, obj->resource.block_num, obj->resource.channel_num);
    if (error != CY_RSLT_SUCCESS && error_accum == CY_RSLT_SUCCESS)
    {
        error_accum = error;
    }
    return error_accum;
}

#define FRACT_DIV_INT(divider)      (((divider) >> 5U) - 1U)
#define FRACT_DIV_FARCT(divider)    ((divider) & 0x1FU)

static uint32_t cy_divider_value(uint32_t frequency, uint32_t frac_bits)
{
    /* UARTs use peripheral clock */
    return ((cy_PeriClkFreqHz * (1 << frac_bits)) + (frequency / 2)) / frequency;
}

cy_rslt_t cy_uart_baud(cy_uart_t *obj, uint32_t baudrate)
{
    Cy_SCB_UART_Disable(obj->base, NULL);
    cy_en_sysclk_status_t status;

    Cy_SysClk_PeriphDisableDivider(obj->clock.div_type, obj->clock.div_num);

    /* Set baud rate */
    if ((obj->clock.div_type == CY_SYSCLK_DIV_16_5_BIT) || (obj->clock.div_type == CY_SYSCLK_DIV_24_5_BIT)) {
        /* Get fractional divider */
        uint32_t divider = cy_divider_value(baudrate * UART_OVERSAMPLE, 5U);

        status = Cy_SysClk_PeriphSetFracDivider(obj->clock.div_type,
                                                obj->clock.div_num,
                                                FRACT_DIV_INT(divider),
                                                FRACT_DIV_FARCT(divider));
    } else {
        /* Get integer divider */
        status = Cy_SysClk_PeriphSetDivider(obj->clock.div_type,
                                            obj->clock.div_num,
                                            cy_divider_value(baudrate * UART_OVERSAMPLE, 0));
    }

    Cy_SysClk_PeriphEnableDivider(obj->clock.div_type, obj->clock.div_num);

    Cy_SCB_UART_Enable(obj->base);
    return status;
}

cy_rslt_t cy_uart_getc(cy_uart_t *obj, uint8_t *value)
{
    uint32_t read_value = CY_SCB_UART_RX_NO_DATA;
    while (read_value == CY_SCB_UART_RX_NO_DATA)
    {
        read_value = Cy_SCB_UART_Get(obj->base);
    }
    *value = (uint8_t)read_value;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_putc(cy_uart_t *obj, uint32_t value)
{
    uint32_t count = 0;
    while (count == 0)
    {
        count = Cy_SCB_UART_Put(obj->base, value);
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_is_readable(cy_uart_t *obj, bool *readable)
{
    uint32_t read_value = Cy_SCB_UART_GetNumInRxFifo(obj->base);
    *readable = read_value != CY_SCB_UART_RX_NO_DATA;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_is_writable(cy_uart_t *obj, bool *writable)
{
    uint32_t count = Cy_SCB_UART_GetNumInTxFifo(obj->base);
    *writable = count < CY_SCB_BUFFER_SIZE[obj->resource.block_num];
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_clear(cy_uart_t *obj)
{
    Cy_SCB_UART_ClearRxFifo(obj->base);
    Cy_SCB_UART_ClearTxFifo(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_set_flow_control(cy_uart_t *obj, cy_gpio_t cts, cy_gpio_t rts)
{
    cy_rslt_t result;
	cy_resource_inst_t pin_rsc;
    
	if (cts != obj->pin_cts)
	{
		if (NC == cts)
		{
			result = cy_disconnect_pin(cts);
			
			if (CY_RSLT_SUCCESS == result)
			{
				Cy_SCB_UART_DisableCts(obj->base);
				
				pin_rsc = cy_utils_get_gpio_resource(cts);
				result = cy_hwmgr_free(&pin_rsc);
			}
		}
		else
		{
			const cy_resource_pin_mapping_t *cts_map = CY_UTILS_GET_RESOURCE(cts, cy_pin_map_scb_uart_cts);
			if (obj->resource.block_num != cts_map->inst->block_num ||
				obj->resource.channel_num != cts_map->inst->channel_num)
			{
				return CY_RSLT_ERR_CSP_UART_INVALID_PIN;
			}
			
			pin_rsc = cy_utils_get_gpio_resource(cts);
			result = cy_hwmgr_reserve(&pin_rsc);
			
			if (CY_RSLT_SUCCESS == result)
			{
				Cy_SCB_UART_EnableCts(obj->base);
				result = cy_connect_pin(cts_map);
			}
		}
		
		if (result != CY_RSLT_SUCCESS)
		{
			return result;
		}
		obj->pin_cts = cts;
	}
	if (rts != obj->pin_rts)
	{
		if (NC == rts)
		{
			result = cy_disconnect_pin(rts);
			
			if (CY_RSLT_SUCCESS == result)
			{
				pin_rsc = cy_utils_get_gpio_resource(rts);
				result = cy_hwmgr_free(&pin_rsc);
			}
		}
		else
		{
			const cy_resource_pin_mapping_t *rts_map = CY_UTILS_GET_RESOURCE(rts, cy_pin_map_scb_uart_rts);
			if (obj->resource.block_num != rts_map->inst->block_num ||
				obj->resource.channel_num != rts_map->inst->channel_num)
			{
				return CY_RSLT_ERR_CSP_UART_INVALID_PIN;
			}
			
			pin_rsc = cy_utils_get_gpio_resource(rts);
			result = cy_hwmgr_reserve(&pin_rsc);
			
			if (CY_RSLT_SUCCESS == result)
			{
				result = cy_connect_pin(rts_map);
			}
		}
		
		if (result != CY_RSLT_SUCCESS)
		{
			return result;
		}
		obj->pin_rts = rts;
	}
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_tx(cy_uart_t *obj, void *tx, size_t *tx_length)
{
    *tx_length = Cy_SCB_UART_PutArray(obj->base, tx, *tx_length);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_rx(cy_uart_t *obj, void *rx, size_t *rx_length)
{
    *rx_length = Cy_SCB_UART_GetArray(obj->base, rx, *rx_length);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_tx_asynch(cy_uart_t *obj, void *tx, size_t length)
{
    cy_en_scb_uart_status_t uart_status = Cy_SCB_UART_Transmit(obj->base, tx, length, &(obj->context));
    return uart_status == CY_SCB_UART_SUCCESS
        ? CY_RSLT_SUCCESS
        : CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_MODULE_UART, 0);
}

cy_rslt_t cy_uart_rx_asynch(cy_uart_t *obj, void *rx, size_t length)
{
    cy_en_scb_uart_status_t uart_status = Cy_SCB_UART_Receive(obj->base, rx, length, &(obj->context));
    return uart_status == CY_SCB_UART_SUCCESS
        ? CY_RSLT_SUCCESS
        : CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_MODULE_UART, 0);
}

cy_rslt_t cy_uart_is_tx_active(cy_uart_t *obj, bool *active)
{
    *active = 0UL != (obj->context.txStatus & CY_SCB_UART_TRANSMIT_ACTIVE);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_is_rx_active(cy_uart_t *obj, bool *active)
{
    *active = 0UL != (obj->context.rxStatus & CY_SCB_UART_RECEIVE_ACTIVE);
    return CY_RSLT_SUCCESS;
}

