dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6csp/hal/src/cy_hal_uart.c
cy_rslt_t cy_uart_tx_abort(cy_uart_t *obj)
{
    Cy_SCB_UART_AbortTransmit(obj->base, &(obj->context));
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_rx_abort(cy_uart_t *obj)
{
    Cy_SCB_UART_AbortReceive(obj->base, &(obj->context));
    return CY_RSLT_SUCCESS;
}

static cy_uart_irq_event_t cy_convert_interrupt_cause(uint32_t pdl_cause)
{    
    cy_uart_irq_event_t cause = CY_UART_IRQ_NONE;
    if (pdl_cause == CY_SCB_UART_TRANSMIT_IN_FIFO_EVENT)
    {
        cause = CY_UART_IRQ_TX_TRANSMIT_IN_FIFO;
    }
    else if (pdl_cause == CY_SCB_UART_TRANSMIT_DONE_EVENT)
    {
        cause = CY_UART_IRQ_TX_DONE;
    }
    else if (pdl_cause == CY_SCB_UART_RECEIVE_DONE_EVENT)
    {
        cause = CY_UART_IRQ_RX_DONE;
    }
    else if (pdl_cause == CY_SCB_UART_RB_FULL_EVENT)
    {
        cause = CY_UART_IRQ_RX_FULL;
    }
    else if (pdl_cause == CY_SCB_UART_RECEIVE_ERR_EVENT)
    {
        cause = CY_UART_IRQ_RX_ERROR;
    }
    else if (pdl_cause == CY_SCB_UART_TRANSMIT_ERR_EVENT)
    {
        cause = CY_UART_IRQ_TX_ERROR;
    }
    return cause;
}

cy_rslt_t cy_uart_register_irq(cy_uart_t *obj, cy_uart_irq_handler_t handler, void *handler_arg)
{
    uint8_t idx = obj->resource.block_num;
    cy_uart_config_structs[idx] = obj;
    cy_uart_user_callbacks[idx] = handler;
    cy_uart_callback_args[idx] = handler_arg;
    Cy_SCB_UART_RegisterCallback(obj->base, cy_uart_cb_wrapper_table[idx], &(obj->context));
    if (NVIC_GetEnableIRQ(CY_SCB_IRQ_N[idx]) == 0)
    {
        // default interrupt priority of 7 (lowest possible priority).
        cy_stc_sysint_t irqCfg = {CY_SCB_IRQ_N[idx], 7u};

        Cy_SysInt_Init(&irqCfg, cy_uart_interrupts_dispatcher_table[idx]);
        NVIC_EnableIRQ(CY_SCB_IRQ_N[idx]);
    }
    
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cy_uart_irq_enable(cy_uart_t *obj, cy_uart_irq_event_t event, bool enable)
{
    if (enable)
    {
        obj->irq_cause |= event;
    }
    else
    {
        obj->irq_cause &= ~event;
    }
    return CY_RSLT_SUCCESS;
}
